SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( D49_62774   
 comment( Class D49 )
 Type ( Engine )
 WagonShape ( D49_62774.S )
 Size  ( 2.7m 3.9m 10.4m )
 CentreOfGravity ( 0m 1.7m 0m )
 Centre ( 0m 0m 0m )
 Mass ( 66t )
 InertiaTensor ( Box(3.1m 3.9m 10.5m) )
 Coupling (
  Type ( Chain )
  Spring (
   Stiffness ( 1e6N/m 2e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   Break ( 3.2e6N 3.2e6N )
   r0 ( 20cm 40cm )
  )
 )
 
 Adheasion ( 0.1 0.3 2 0.5 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 240kN )
 DerailBufferForce ( 400kN )
 WheelRadius ( 0.4825m )
 NumWheels ( 1 )
 Friction (
  50N/m/s   1  -1mph  0  1
  5.1N/rad/s  1  -1rad/s  0  1
 )
 
 BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 90kN )

 MaxHandbrakeForce( 80kN )
 NumberOfHandbrakeLeverSteps( 100 )
 
        MaxReleaseRate( 10 )
        MaxApplicationRate( 10 )
        MaxAuxilaryChargingRate( 10 )
        BrakeCylinderPressureForMaxBrakeBrakeForce( 21 )        
 
     Sound ( "FScotEng.sms" )
 
     Lights ( 4
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ff7200 )
     Position ( -0 2.3 -3.4 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ffe610 )
     Position ( -0 2.3 -3.4 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
         
        )
      )
   )

  Light (
   comment( Sphere of light )
    Type  ( 1 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
    Cycle  ( 0 )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( 20ffffff )
         Position ( 0 2.5 15 )
         Transition ( 0 )
         Radius ( 80.0 )
         Angle ( 13.0 )
         
        )
      )
   )
  Light (
   comment( Head light right dim )
    Type  ( 0 )
    Conditions (
       Headlight ( 3 )
       Unit ( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( 99ffffff )
         Position ( -1.01 1.44 4.7 )
         Azimuth ( 0.0 -5.0 5.0 )
         Transition ( 0 )
         Radius ( 0.4 )
         Elevation ( -10 -10 -10 )
        )
      )
   )
  Light (
   comment( Head light left dim )
    Type  ( 0 )
    Conditions (
       Headlight ( 3 )
       Unit ( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( 99ffffff )
         Position ( 1.01 1.44 4.7 )
         Azimuth ( 0.0 -5.0 5.0 )
         Transition ( 0 )
         Radius ( 0.4 )
         Elevation ( -10 -10 -10 )
        )
      )
   )
  )
 )


Engine ( D49_62774
 comment( Class D49 )
 Effects
 (
  SteamSpecialEffects
  (
   comment
   (
    the format of these little blocks is as follow:

    offset.x offset.y offset.z
    normal.x normal.y normal.z
    width in metres

    defining the offset from the shape pivot point
    where steam / smoke should appear, the direction
    it should go and the width of the nozzle
   )

   WhistleFX
   (
    0 4.0 -2.9
    0 1 0
    0.05
   )

   SafetyValvesFX
   (
    0 3.885 -2.1
    0 1 0
    0.2
   )

   StackFX
   (
    0 4.25 3.0
    0 1 0
    0.2
   )

   DrainpipeFX
   (
    -1.5 1.258 -3.886
    -0.4 -1 -0.2
    0.05
   )

   CylindersFX
   (
    -1.223 0.7 3.7
    0 0 1
    0.1
   )

   CylindersFX
   (
    1.223 0.7 3.7
    0 0 1
    0.1
   )
  )
 )

 Wagon ( D49_62774 )
 IsTenderRequired( 1 ) 
 Type ( Steam )
 MaxPower ( 1200kW )
 MaxForce ( 21555lbf )
 MaxVelocity ( 80mph )
 WheelRadius ( 0.975m )
 Sanding ( 1e9mph )
 NumWheels ( 4 )
 BoilerLength ( 4.2m )
 BoilerVolume ( "160*(ft^3)" )
 BoilerEffectivity ( 0.7 )
 DraftingEffect ( 0.7 )
 BoilerResponsiveness ( 1.01 )
 CoalBurnage ( 3.6lb/hp/h )
 MaxBoilerOutput ( 32500lb/h )
 NumCylinders ( 3 )
 CylinderStroke ( 26in )
 CylinderDiameter ( 17in )
 CylinderVolume ( "12.8*(ft^3)" )
 CylinderEffectivity ( 1 )
 InjectorSizes ( 11mm 12mm )
 ExhaustLimit ( 36000lb/h )
 PrimingFactor ( 1 )
 BlastExponent ( 0.8 )
 MaxBoilerPressure ( 180psi )
 MaxFireMass ( 2500lb )
 IdealFireMass ( 1800lb )
 MaxWaterMass ( 4000lb )  
 SafetyValvesSteamUsage ( 8000lb/h )
 ShovelCoalMass ( 1lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 12000lb )
 MaxTenderWaterMass ( 35000lb )
 comment(0 for live steam, 1 for exhaust steam)
 InjectorTypes( 0 1 ) 
 SuperHeater ( 1.23 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 SteamMaxSmokeUnitsReleaseRate( 10 )
 MaxSteamHeatingPressure( 45 )
 SafetyValvePressureDifference( 5 )
 SteamGaugeGlassHeight( 10 )
 SteamFiremanMaxPossibleFiringRate( 26000 )

 BasicSteamUsage ( 100lb/h )
 BasicCoalUsage ( 100lb/h )
 comment( min steam pressure, min water proportion, max water proportion  )
 InjectorLimits1 ( 50psi 0.6 1 )
 InjectorLimits2 ( 60psi 0 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

        VacuumBrakesSmallEjectorPowerRating( 3.5 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 500 )
 VacuumBrakesLargeEjectorUsageRate( 2400 )
 VacuumBrakesHasVacuumPump( 0 )

 TrainBrakesControllerMaxReleaseRate( 12 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
        EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
        BrakesEngineControllers( "Hand, Train" )

 SteamSmallestCutoff( 8 )
 NumberOfDamperSteps( 4 )

 RegulatorValveType ( Twin_port )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorPilotValveExponent( 1.7 )
 RegulatorSecondValveExponent( 1.7 )
 RegulatorPilotValveFullOpenning( 0.3 )
 RegulatorMainValveInitialOpenning( 0.4 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 SteamWaterScoopMinPickupSpeed( 25 ) comment( mph )
 SteamWaterScoopMaxPickupSpeed( 60 ) comment( mph )
 SteamWaterScoopResistance( 8500N )
 comment( pounds per second. 6000gallons per minute max. )
 SteamWaterScoopMaxPickupRate( 1000 )
 
 SteamSmokeUnitsPerPoundOfFuel( 6.3 )

 CabView ( scotsman.cvf )
 HeadOut (  -1.7 3.1 -4.5 )

        EngineControllers (
            comment( Engine controls )
        
            Regulator ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            Cutoff    ( -0.55 0.75 0.01 0 
                NumNotches( 0 )
            )
            Brake_Train ( 0 1 0.01 0.65 
                NumNotches( 3
                    Notch(0     1 TrainBrakesControllerReleaseStart )
                    Notch(0.4   1 TrainBrakesControllerRunningStart )
                    Notch(0.5   1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            Shovel ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 1 
                NumNotches( 0 )
            )
            DampersBack ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

 comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
 EngineVariables( 875 1850 3000 150 0.5 35000 11200 350 1 1 )
     Sound ( "FScotCab.sms" )
     Name ( "D49 THE STAINTONDALE" )
  Description (
  "London & North Eastern Railway's No. 2751 the GOATHLAND  Class D49-2 Hunts steam locomotive. "+
 "Built 10th July 1934 at the Darlington Works, withdrawn and disposed of March 1959. "+ 
  "The Gresley Class D49 4-4-0s were introduced late 1927, and in all Seventy-Six were Built. "+ 
  "Thirty-Four Shire Class D49-1s all had piston valves and Forty-Two Hunt Class D49 -2s "+
 "all fitted with Lentz rotary cam poppet valves. \n\n"+
  "Locomotive type & no.: LNER D49 4-4-0, No. 2751\n\n"+
  "Power source: 180 psi hand-fired, coal burning boiler\n\n"+
  "Wheel configuration: Four 80-in. (2.03m) diameter driving wheels in a 4-4-0 configuration\n\n"+
  "Max. speed: 100 mph (161 km/h) under favorable conditions\n\n"+
  "Height: 13 ft. 2 in. (4.03 m)\n\n"+
  "Width: 9 ft. (2.74 m) (over footplate)\n\n"+
  "Length (locomotive & tender): 58 ft 9 in. (21.47 m)\n\n"+
  "Weight (locomotive & tender): 108 U.S. tons  (97.2 metric tons)\n\n"+
  "Tractive effort: 22,486 lb (13,532.93 kg)\n\n"+
  "Coal capacity: 6 U.S. tons ( 5.4 metric tons)\n\n"+
  "Water capacity: 3,500 IMP gallons (15,925 liters)\n\n"+
  "Brakes: Vacuum, operates at 21 in. Hg\n\n" 
)
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+  
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)